_posts/2018-02-16-profiling-rcpp-packages.html
---
date: 2018-02-16
tags: 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: Profiling Rcpp packages
excerpt: Notes on profiling Rcpp code
categories: 
- R programming Cpp
---
<p>
Lately I've been working with C++ code. <a href="http://wiki.c2.com/?MakeItWorkMakeItRightMakeItFast">I've got it to work, I've got
it right</a> and now I need to make it fast. And the first step of
optimization is always profiling. Except I'm working on an R package
(and python) which calls the C++ code. So how do I profile across
different languages?
</p>

<p>
Fortunately there's a useful <a href="https://stackoverflow.com/questions/13224322/profiling-rcpp-code-on-os-x">SO answer</a> off which I'll be basing most
of this post. We'll assume you're developing an R package in the
directory <code>~/pkg</code> with a <code>src</code> sub-directory which contains your C++
code.
</p>

<ol class="org-ol">
<li>Install the <a href="https://github.com/gperftools/gperftools">gperftools library</a>: follow instructions for your
particular system (for me it's a simple <code class="src src-shell">pacman -S gperftools</code>).</li>

<li>Add <code>-lprofiler</code> to the <code>PKG_LIBS</code> section of your Makevars file in
<code>pkg/src</code>. Mine looks like <code>PKG_LIBS = $(LAPACK_LIBS) $(BLAS_LIBS)
  $(FLIBS) -lprofiler</code>.</li>

<li><p>
Make a new file in <code>~/pkg/src</code> with contents
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #919191;">#include</span> <span style="color: #61CE3C;">&lt;Rcpp.h&gt;</span>
<span style="color: #919191;">#include</span> <span style="color: #61CE3C;">"gperftools/profiler.h"</span>

<span style="color: #4c83ff;">using</span> <span style="color: #4c83ff;">namespace</span> <span style="color: #96CBFE;">Rcpp</span>;

<span style="color: #8B8989; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">[[Rcpp::export]]</span>
<span style="color: #afd8af;">SEXP</span> <span style="color: #ff1493;">start_profiler</span>(<span style="color: #afd8af;">SEXP</span> <span style="color: #ff69b4;">str</span>) {
  ProfilerStart(as&lt;<span style="color: #4c83ff;">const</span> <span style="color: #afd8af;">char</span>*&gt;(str));
  <span style="color: #4c83ff;">return</span> R_NilValue;
}

<span style="color: #8B8989; font-style: italic;">// </span><span style="color: #8B8989; font-style: italic;">[[Rcpp::export]]</span>
<span style="color: #afd8af;">SEXP</span> <span style="color: #ff1493;">stop_profiler</span>() {
  ProfilerStop();
  <span style="color: #4c83ff;">return</span> R_NilValue;
}
</pre>
</div></li>

<li>Recompile your package and load your package</li>

<li><p>
You can profile by running R code:
</p>
<div class="org-src-container">
<pre class="src src-R">start_profiler(<span style="color: #61CE3C;">"/tmp/profile.out"</span>)
run_your_cpp_stuff()
stop_profiler()

start_profile(<span style="color: #61CE3C;">"/tmp/another-thing.out"</span>)
that_other_thing(1:1000)
stop_profiler()
</pre>
</div>

<p>
where the argument to <code class="src src-r">start_profiler</code> is the
filename you want to save the profile in. You can have multiple
results; just save them to their own file.
</p></li>

<li>Read the profile with <code class="src src-shell">pprof --text pkg/src/pkg.so /tmp/profile.out</code>. My stuff is small enough that just reading the
text output is sufficient to identify my bottlenecks. There's also
fancier versions like <code class="src src-shell">pprof --gv pkg/src/pkg.so /tmp/profile.out</code></li>

<li>Optimize and repeat</li>
</ol>
